#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-955380/aws-firewall-github-action/runs/run-sJT6MknrubtXGBMu

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_networkfirewall_rule_group.Stateful-FWRuleGroup-Rule3 will be created
  + resource "aws_networkfirewall_rule_group" "Stateful-FWRuleGroup-Rule3" {
      + arn          = (known after apply)
      + capacity     = 3000
      + description  = "Testing123"
      + id           = (known after apply)
      + name         = "Stateful-FWRuleGroup-Rule3"
      + tags_all     = (known after apply)
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {
          + rule_variables {
              + ip_sets {
                  + key = "SUBNET1"

                  + ip_set {
                      + definition = [
                          + "10.0.1.0/24",
                        ]
                    }
                }
              + ip_sets {
                  + key = "SUBNET2"

                  + ip_set {
                      + definition = [
                          + "10.0.2.0/24",
                        ]
                    }
                }
              + ip_sets {
                  + key = "SUBNET3"

                  + ip_set {
                      + definition = [
                          + "10.0.3.0/24",
                        ]
                    }
                }
            }

          + rules_source {

              + stateful_rule {
                  + action = "PASS"

                  + header {
                      + destination      = "$SUBNET3"
                      + destination_port = "ANY"
                      + direction        = "FORWARD"
                      + protocol         = "TCP"
                      + source           = "ANY"
                      + source_port      = "ANY"
                    }

                  + rule_option {
                      + keyword  = "sid:2"
                      + settings = []
                    }
                }
              + stateful_rule {
                  + action = "PASS"

                  + header {
                      + destination      = "ANY"
                      + destination_port = "ANY"
                      + direction        = "FORWARD"
                      + protocol         = "TCP"
                      + source           = "ANY"
                      + source_port      = "ANY"
                    }

                  + rule_option {
                      + keyword  = "sid:1"
                      + settings = []
                    }
                }
            }

          + stateful_rule_options {
              + rule_order = "STRICT_ORDER"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @vantruongsinh, Action: `pull_request`*